package cwb.honor.oo;

/**
 * Created by PC-CWB on 2017/4/3.
 */
public class PartDemo {

    /**
     * 定义位置不同：
     * 成员变量：定义在类中，方法的外部
     * 局部变量：定义在方法内，语句内
     */

    /**
     * 默认值：
     * 成员变量：有自己的默认值
     * 局部变量：没有默认值，不赋值不能使用
     */

    /**
     * 作用域：
     * 成员变量：成员变量：作用域是整个类
     * 局部变量：方法内，局部外
     */

    /**
     * 内存位置不同：
     * 成员变量：跟随对象进入堆内存存储
     * 局部变量：更随自己的方法进入栈内存存储
     */

    /**
     * 生命周期不同：
     * 成员变量：跟随对象，堆中存储，内容等待JVM清理
     * 局部变量：跟随方法，方法出栈，变量即出栈。
     */

    public void test(){

    }
}
